# Напишите программу, которая определит позицию второго
# вхождения строки в списке либо сообщит, что её нет.

# *Пример:*

# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1

my_spisok = ["йцу", "фыв", "ячс", "йцу", "цук", "йцукен", "йцу"]
znak = 'йцу'
count = 0

for item in range(len(my_spisok)):
  if my_spisok[item] == znak:
    count += 1
    if count == 2: 
       print(item)  
       break
else: print(-1)


# my_spisok = ['frd','tafg','543','frd','123','rev', '543', '543']
# znak = '543'
# list1 = [i for i, x in enumerate(my_spisok) if x == znak]
# print(list1)
# if len(list1) > 1:
#   print(list1[1])
# else:
#   print('-1')
